jklim01/ece4191-lesgo/4191_g6/lesgo_g6.cydsn/Generated_Source/PSoC5/ir_r_sreg.h
/*******************************************************************************
* File Name: ir_r_sreg.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_ir_r_sreg_H) /* CY_STATUS_REG_ir_r_sreg_H */
#define CY_STATUS_REG_ir_r_sreg_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} ir_r_sreg_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 ir_r_sreg_Read(void) ;
void ir_r_sreg_InterruptEnable(void) ;
void ir_r_sreg_InterruptDisable(void) ;
void ir_r_sreg_WriteMask(uint8 mask) ;
uint8 ir_r_sreg_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define ir_r_sreg_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define ir_r_sreg_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define ir_r_sreg_Status             (* (reg8 *) ir_r_sreg_sts_sts_reg__STATUS_REG )
#define ir_r_sreg_Status_PTR         (  (reg8 *) ir_r_sreg_sts_sts_reg__STATUS_REG )
#define ir_r_sreg_Status_Mask        (* (reg8 *) ir_r_sreg_sts_sts_reg__MASK_REG )
#define ir_r_sreg_Status_Aux_Ctrl    (* (reg8 *) ir_r_sreg_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_ir_r_sreg_H */


/* [] END OF FILE */
